# 规则替换配置
# 每个元组: (正则模式, 替换文本)
# 替换文本为空字符串 "" 表示删除匹配内容

RULES = [
    ('毫安时', 'mAh'),
    ('赫兹', 'Hz'),
    ('伏特', 'V'),
    ('二、', '二'),
    ('负一', '-1'),
    (r'(艾特)\s*(QQ)\s*点\s*', '@qq.'),
    (r'(艾特)\s*([一幺]六三)\s*点\s*', '@163.'),
    (r'(艾特)\s*(\w+)\s*(点)\s*(\w+)', r'@\2.\4'),
    ('呃', ""),
    ('欧拉玛', 'Ollama'),
    (r'\/sil', ""),
    (r'\[breath\]', ""),
    ('(^逗号[，。]?)|([，。]?逗号$)', '，'),
    ('(^句号[，。]?)|([，。]?句号$)', '。'),
    ('(^问号[，。]?)|([，。]?问号$)', '？'),
    ('(?<=^)[，。]?回车[，。 ]?|(?<=回车)回车[，。 ]?|(?<=回车[，。 ])回车[，。 ]?|[，。]?回车[，。]?(?=回车)|[，。]?回车$', r'\n'),
    ('(提|递)交一下给(他|它|她)', '提交一下git'),
    ('上传代码仓库', '提交一下git'),
]
